SunSunSun-23413011/RX231_Mouse3/Modified05 DF Clear/src/smc_gen/r_datfrx_rx/src/r_flash_dm_rx_if.c
/*
* Copyright (c) 2018(2025) Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/************************************************************************************************
* File Name    : r_flash_dm_rx_if.c
* Version      : 2.31
* Description  : DATFRX interface source file
*************************************************************************************************/
/************************************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 28.09.2018 2.00     First Release
*              : 25.01.2019 2.01     English PDF added, Fixed blank check processing and Busy check procedure
*              : 21.04.2023 2.10     Added macro constant judgment of "FLASH_TYPE_5"
*              : 14.03.2024 2.30     Delete the following macro judgments.
*                                    "FLASH_CFG_CODE_FLASH_ENABLE"
*                                    "FLASH_CFG_CODE_FLASH_BGO"
*              : 20.03.2025 2.31     Changed the disclaimer.
*************************************************************************************************/

/************************************************************************************************
Includes <System Includes> , "Project Includes"
*************************************************************************************************/
#include "r_flash_dm_rx_if.h"
#include "r_flash_dm_private.h"

#if(FLASH_TYPE == FLASH_TYPE_1)
#include "r_dispatch_1.h"
#else
#include "r_dispatch_2.h"
#endif

/************************************************************************************************
Macro definitions
*************************************************************************************************/

/************************************************************************************************
Local Typedef definitions
*************************************************************************************************/

/************************************************************************************************
Exported global functions (to be accessed by other files)
*************************************************************************************************/

/************************************************************************************************
Private global variables and functions
*************************************************************************************************/
/* narrow APIs*/
#if(FLASH_TYPE == FLASH_TYPE_1)
static e_flash_dm_status_t r_flash_dm_d1_init(void);
static e_flash_dm_status_t r_flash_dm_d1_read(st_flash_dm_info_t * p_flash_dm_info);
static e_flash_dm_status_t r_flash_dm_d1_write(st_flash_dm_info_t * p_flash_dm_info);
static e_flash_dm_status_t r_flash_dm_d1_erase(void);
static e_flash_dm_status_t r_flash_dm_d1_control(e_flash_dm_cmd_t cmd, uint32_t* pcfg);
static e_flash_dm_status_t r_flash_dm_d1_format(void);
static e_flash_dm_status_t r_flash_dm_1_get_writable_size(uint32_t* pcfg);

static st_flash_dispatch_1_hndl_t* (g_flash_dm_handle);

#else /* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */
static e_flash_dm_status_t r_flash_dm_d2_init(void);
static e_flash_dm_status_t r_flash_dm_d2_read(st_flash_dm_info_t * p_flash_dm_info);
static e_flash_dm_status_t r_flash_dm_d2_write(st_flash_dm_info_t * p_flash_dm_info);
static e_flash_dm_status_t r_flash_dm_d2_erase(void);
static e_flash_dm_status_t r_flash_dm_d2_control(e_flash_dm_cmd_t cmd, uint32_t* pcfg);
static e_flash_dm_status_t r_flash_dm_d2_format(void);
static e_flash_dm_status_t r_flash_dm_2_get_writable_size(uint32_t*);

static st_flash_dispatch_2_hndl_t* (g_flash_dm_handle);
#endif/* FLASH_TYPE */

/* common APIs */
static e_flash_dm_status_t r_flash_dm_get_writable_size(uint32_t*);
static e_flash_dm_status_t r_flash_dm_getactivity(uint32_t*);
static e_flash_dm_status_t r_flash_dm_getdatasize(uint32_t*);
static e_flash_dm_status_t r_flash_dm_getdatanum(uint32_t*);
static uint8_t r_flash_dm_drvif_close(void);

#if(FLASH_TYPE == FLASH_TYPE_2)
extern void r_flash_dm_disable_rw(void);
extern void r_flash_dm_enable_rw(void);
#endif

/* user callback */
p_flash_dm_callback r_flash_dm_callbackfunc;

/***************************************************************************************************
* Function Name: R_FLASH_DM_Open
* Description  : Initializes the DATFRX work memory.
* Arguments    : uint32_t * p_flash_dm_work ; Work memory
*              : p_flash_dm_callback func   ; Callback function for end processing
*              :                            ; Processing are format, write, erase, reclaim and error.
* Return Value : FLASH_DM_SUCCESS           ; Successful operation.
*              : FLASH_DM_ERR_ARGUMENT      ; Failed operation of parameter.
*              : FLASH_DM_ERR_OPEN          ; Failed operation of driver interface/
*--------------------------------------------------------------------------------------------------
* Notes        : If control the code flash, must place the source code to the ROM.
*              : (Prohibit the placement to RAM)
***************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Open(uint32_t* p_flash_dm_work, p_flash_dm_callback func)
{
    uint32_t * p_ptr = 0;
    uint32_t i = 0;
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;

    /* Check code flush and data flag setting. */
#if FLASH_CFG_DATA_FLASH_BGO == 0
#error "ERROR in r_flash_rx_config.h configuration. Must ENABLE FLASH_CFG_DATA_FLASH_BGO."
#endif

    /*  Initialize the work memory. */
    if (0 == (uint32_t)p_flash_dm_work)
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    /* Open driver interface. */
    else if (!r_flash_dm_drvif_open())
    {
        ret = FLASH_DM_ERR_OPEN;
    }
    else
    {
#if(FLASH_TYPE == FLASH_TYPE_1)
        /* cast from uint32_t* to st_flash_dispatch_1_hndl_t */
        g_flash_dm_handle = (st_flash_dispatch_1_hndl_t *)p_flash_dm_work;
#else
        /* cast from uint32_t* to st_flash_dispatch_2_hndl_t* */
        g_flash_dm_handle = (st_flash_dispatch_2_hndl_t *)p_flash_dm_work;
#endif

