SunSunSun-23413011/RX231_Mouse3/Modified05 DF Clear/src/smc_gen/r_datfrx_rx/src/r_flash_dm_rx_if.c
        /* ---- Clear the work memory to '0'. --- */
        p_ptr = (uint32_t *)g_flash_dm_handle;
#if(FLASH_TYPE == FLASH_TYPE_1)
        /* WAIT_LOOP */
        for (i = (sizeof(st_flash_dispatch_1_hndl_t) / sizeof(uint32_t)); i > 0; i--)
#else
        /* WAIT_LOOP */
        for (i = (sizeof(st_flash_dispatch_2_hndl_t) / sizeof(uint32_t)); i > 0; i--)
#endif
        {
            *p_ptr++ = 0;
        }

        /* Register the callback function. */
        r_flash_dm_callbackfunc = 0;
        if (0 != func)
        {
            r_flash_dm_callbackfunc = func;
        }

        /* Pass address to dm */
        r_flash_dm_set_dm((uint32_t)g_flash_dm_handle);

        /* Pass address to dispatch */
        r_flash_dm_set_dispatch((uint32_t)g_flash_dm_handle);

#if(FLASH_TYPE == FLASH_TYPE_2)
        /* enable read/write */
        r_flash_dm_enable_rw();
#endif
    }
    return ret;
} /* End of function R_FLASH_DM_Open() */


/************************************************************************************************
* Function Name: R_FLASH_DM_Close
* Description  : Finishes the DATFRX.
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS       ; Successful operation
*              : FLASH_DM_ERR_CLOSE     ; Failed operation of Close
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Close(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;

    /* Check Argument. */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_CLOSE;
    }
    /* Release the FLASH handle. */
    else if (!r_flash_dm_drvif_close())
    {
        ret = FLASH_DM_ERR_CLOSE;
    }
    else
    {
        /* Release the FLASH DM handle. */
        g_flash_dm_handle = 0;

#if(FLASH_TYPE == FLASH_TYPE_2)
        /* disable read/write */
        r_flash_dm_disable_rw();
#endif
    }

    return ret;
} /* End of function R_FLASH_DM_Close() */

/************************************************************************************************
* Function Name: R_FLASH_DM_GetVersion
* Description  : Returns the version of DATFRX.
*                The version number is encoded such that the top two bytes are
*                the major version number and the bottom two bytes are the minor
*                version number.
* Arguments    : None
* Return Value : Version number     ; Successful operation
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint32_t R_FLASH_DM_GetVersion(void)
{
    uint32_t version = (FLASH_DM_VERSION_MAJOR << 16) | FLASH_DM_VERSION_MINOR;

    return version;
} /* End of function R_FLASH_DM_GetVersion() */

/************************************************************************************************
* Function Name: R_FLASH_DM_Init
* Description  : Initializes the device.
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS               ; Successful operation.(Type1)
*              : FLASH_DM_ADVANCE               ; Successful operation, call advanced function.(Type2,3,4)
*              : FLASH_DM_SUCCESS_REQUEST_ERASE ; Successful operation, request erase.
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*              : FLASH_DM_ERR_REQUEST_FORMAT    ; Failed operation and request format.(Type1)
*              : FLASH_DM_ERR_REQUEST_INIT      : Failed operation and request initialization.
*              : FLASH_DM_ERR_INIT              ; Failed operation of Initialize.
*------------------------------------------------------------------------------------------------
* Notes        : Always, Place the source code to the ROM.
*************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Init(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
#if(FLASH_TYPE == FLASH_TYPE_1)
    ret = r_flash_dm_d1_init();
#else /* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */
    ret = r_flash_dm_d2_init();
#endif /* FLASH_TYPE */
    return ret;
} /* End of function R_FLASH_DM_Init() */

/************************************************************************************************
* Function Name: R_FLASH_DM_InitAdvance
* Description  : Initializes the device.
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS               ; Successful operation.
*              : FLASH_DM_ADVANCE               ; Successful operation, please call R_FLASH_InitAdvance().
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*              : FLASH_DM_ERR_REQUEST_FORMAT    ; Failed operation and format initialization.
*              : FLASH_DM_ERR_REQUEST_INIT      ; Failed operation and request initialization.
*              : FLASH_DM_ERR_INIT              ; Failed operation of Initialize.
*------------------------------------------------------------------------------------------------
* Notes        : Always, Place the source code to the ROM.
*************************************************************************************************/
#if(FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5)
e_flash_dm_status_t R_FLASH_DM_InitAdvance(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;

    /* ==== Handle Check ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_INIT;
    }
    /* ==== Check busy. ==== */
    else if (g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        g_flash_dm_handle->activity = FLASH_DM_ACT_INITIALIZING;
        ret = r_flash_dm_1st_check(FLASH_DM_INIT_1ST_CHECK);

        /* If the DM is performing or the activity is not idle, do not initialize. */
        if(FLASH_DM_SUCCESS == ret)
        {
            /* Check status. */
            g_flash_dm_handle->initialized = 0u;
            ret = r_flash_dm_init_set2();
        }
    }
    g_flash_dm_handle->activity = FLASH_DM_ACT_IDLE;
    g_flash_dm_handle->api_call = tmp;
    return ret;
}/* End of function R_FLASH_DM_InitAdvance() */
#endif/* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */

/************************************************************************************************
* Function Name: R_FLASH_DM_Format
* Description  : Formats the device.
* Arguments    : none
* Return Value : FLASH_DM_ACCEPT            ; Successful operation reception.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Format(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
#if(FLASH_TYPE == FLASH_TYPE_1)
    ret = r_flash_dm_d1_format();
#else /* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */
    ret = r_flash_dm_d2_format();
#endif /* FLASH_TYPE */
    return ret;
} /* End of function R_FLASH_DM_Format() */

/************************************************************************************************
* Function Name: R_FLASH_DM_Read
* Description  : Reads data from the device.
* Arguments    : st_flash_dm_info_t * p_flash_dm_info
*              :    uint8_t     data_no         ; The data no.
*              :    uint8_t   * p_data          ; Pointer to read data buffer
* Return Value : FLASH_DM_SUCCESS               ; Successful operation.
*              : FLASH_DM_ERR_ARGUMENT          ; Failed operation of parameter.
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*              : FLASH_DM_ERR_DATA_NOT_PRESENT  ; Failed operation of the data no. to support.(TYPE1)
*              : FLASH_DM_ERR_REQUEST_INIT      ; Failed operation and request initialization.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Read(st_flash_dm_info_t * p_flash_dm_info)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
#if(FLASH_TYPE == FLASH_TYPE_1)
    ret = r_flash_dm_d1_read(p_flash_dm_info);
#else /* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */
    ret = r_flash_dm_d2_read(p_flash_dm_info);
#endif /* FLASH_TYPE */
    return ret;
} /* End of function R_FLASH_DM_Read() */

/************************************************************************************************
* Function Name: R_FLASH_DM_Write
* Description  : Writes data to the device.
* Arguments    : st_flash_dm_info_t * p_flash_dm_info
*              :    uint8_t         data_no     ; The data no.
*              :    uint8_t       * p_data      ; Pointer to write data buffer
* Return Value : FLASH_DM_ACCEPT                ; Successful operation reception.
*              : FLASH_DM_ERR_REQUEST_INIT      ; Failed operation and request initialization.
*              : FLASH_DM_ERR_ARGUMENT          ; Failed operation of parameter.
*              : FLASH_DM_ERR_REQUEST_ERASE     ; Failed operation and request erase.(TYPE,2,3,4)
*              : FLASH_DM_ERR_REQUEST_RECLAIM   ; Failed operation and request reclaim.(TYPE1)
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Write(st_flash_dm_info_t * p_flash_dm_info)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
#if(FLASH_TYPE == FLASH_TYPE_1)
    ret = r_flash_dm_d1_write(p_flash_dm_info);
#else /* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */
    ret = r_flash_dm_d2_write(p_flash_dm_info);
#endif /* FLASH_TYPE */
    return ret;
} /* End of function R_FLASH_DM_Write() */

/************************************************************************************************
* Function Name: R_FLASH_DM_Erase
* Description  : Erases a garbage block.
* Arguments    : None
* Return Value : FLASH_DM_ACCEPT            ; Successful operation reception.
*              : FLASH_DM_ERR_REQUEST_INIT  ; Failed operation and request initialization.
*              : FLASH_DM_NO_INVALID_BLOCK  ; Successful operation no invalid block.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*              : FLASH_DM_ERR_ERASE         ; Failed erase.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Erase(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
#if(FLASH_TYPE == FLASH_TYPE_1)
    ret = r_flash_dm_d1_erase();
#else /* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */
    ret = r_flash_dm_d2_erase();
#endif /* FLASH_TYPE */
    return ret;
} /* End of function R_FLASH_DM_Erase() */

/************************************************************************************************
* Function Name: R_FLASH_DM_Control
* Description  : Define various functions.
* Arguments    : e_flash_dm_cmd_t   cmd     ; Control command.
*              : uint32_t*          pcfg    ; Work memory.
* Return Value : FLASH_DM_SUCCESS           ; Successful operation.
*              : FLASH_DM_ERR_REQUEST_INIT  ; Failed operation and request initialization.
*              : FLASH_DM_ERR_ARGUMENT      ; Failed operation of parameter.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*              : FLASH_DM_ERR               ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Control(e_flash_dm_cmd_t cmd, uint32_t* pcfg)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
#if(FLASH_TYPE == FLASH_TYPE_1)
    ret = r_flash_dm_d1_control(cmd, pcfg);
#else /* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */
    ret = r_flash_dm_d2_control(cmd, pcfg);
#endif /* FLASH_TYPE */
    return ret;
} /* End of function R_FLASH_DM_Control() */

/************************************************************************************************
* Function Name: r_flash_dm_get_writable_size
* Description  : Acquires the size of free space
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS               ; Successful operation, but no free area.
*              : FLASH_DM_ERR_REQUEST_INIT      ; Failed operation and request initialization.(TYPE1)
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*              : FLASH_DM_ERR_ARGUMENT          ; Failed operation of parameter.(TYPE1)
*              : FLASH_DM_ERR                   ; Failed operation.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_get_writable_size(uint32_t* pcfg)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
#if(FLASH_TYPE == FLASH_TYPE_1)
    ret = r_flash_dm_1_get_writable_size(pcfg);
#else /* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */
    ret = r_flash_dm_2_get_writable_size(pcfg);
#endif /* FLASH_TYPE */
    return ret;
} /* End of function r_flash_dm_get_writable_size() */


