SunSunSun-23413011/RX231_Mouse3/Modified05 DF Clear/src/smc_gen/r_datfrx_rx/src/r_flash_dm_rx_if.c
#if(FLASH_TYPE == FLASH_TYPE_1)
/************************************************************************************************
* Function Name: R_FLASH_DM_Reclaim
* Description  : Switches active block.
* Arguments    : None
* Return Value : FLASH_DM_ACCEPT            ; Successful operation reception.
*              : FLASH_DM_ERR_REQUEST_INIT  ; Failed operation and request initialization.
*              : FLASH_DM_ERR_REQUEST_ERASE ; Failed operation and request erase.
*              : FLASH_DM_ERR_CANT_RECLAIM  ; Failed operation and cannot reclaim.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Reclaim(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;
    uint8_t uc_tmp = 0;

    /* ==== Check Argument. ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_RECLAIM;
    }
    /* ==== Check busy. ==== */
    else if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    /* ==== Detect the erase block. ==== */
    else if (0 != g_flash_dm_handle->p_reclaim )
    {
        ret = FLASH_DM_ERR_REQUEST_ERASE;
    }
    else
    {
        /* ==== Check status. ==== */
        ret = r_flash_dm_1st_check(FLASH_DM_RECLAIM_1ST_CHECK);
        if (FLASH_DM_ERR_BUSY == ret)
        {
            ret = FLASH_DM_ERR_BUSY;
        }
        else if(FLASH_DM_ERR_REQUEST_INIT == ret)
        {
            ret = FLASH_DM_ERR_REQUEST_INIT;
        }
        else
        {
            /* ==== Status Check. ==== */
            g_flash_dm_handle->p_new_active = r_flash_dm_drvif_get_block_info(g_flash_dm_handle->p_active->next);
            if (FLASH_DM_BLOCK_STATUS_READY != g_flash_dm_handle->p_new_active->stat)
            {
                ret = FLASH_DM_ERR_CANT_RECLAIM;
            }
            else
            {
                /* ==== Check if this module is processing callback. ==== */
                if(g_flash_dm_handle->flash_state == DATF_FLASH_CALL)
                {
                    ret = FLASH_DM_ERR_BUSY;
                    /* ==== Start to reclaim. ==== */
                }
                else
                {
                    /* cast from uint8_t to uint8_t */
                    uc_tmp = (g_flash_dm_handle->activity | FLASH_DM_ACT_RECLAIMING);
                    g_flash_dm_handle->activity = uc_tmp;
                    ret = r_flash_dm_dispatch(FLASH_DM_USER_RECLAIM_SETUP);
                }
            }
        }
    }

    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function R_FLASH_DM_Reclaim() */
#endif /* FLASH_TYPE */

#if(FLASH_TYPE == FLASH_TYPE_1)
/************************************************************************************************
* Function Name: r_flash_dm_d1_init
* Description  : Initializes the device.
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS               ; Successful operation.
*              : FLASH_DM_SUCCESS_REQUEST_ERASE ; Successful operation, request erase.
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*              : FLASH_DM_ERR_REQUEST_FORMAT    ; Failed operation and request format.
*              : FLASH_DM_ERR_REQUEST_INIT      : Failed operation and request initialization.
*              : FLASH_DM_ERR_INIT              ; Failed operation of Initialize.
*------------------------------------------------------------------------------------------------
* Notes        : Always, Place the source code to the ROM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d1_init(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    flash_dm_block_ptr_t p_block = 0;
    flash_dm_bh_ptr_t p_bh = 0;
    flash_dm_dh_ptr_t p_dh = 0;
    uint16_t i = 0;
    uint16_t j = 0;
#if defined(FLASH_DM_CHECK_REJECTED_BLOCK)
    uint16_t k = 0;
    bool ret_bool = true;
#endif /* defined(FLASH_DM_CHECK_REJECTED_BLOCK) */
    uint16_t dp = 0;
    uint8_t tmp = g_flash_dm_handle->api_call;
    uint8_t nblock_full = 0;
    uint32_t addr = 0;

    /* ==== Handle Check ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_INIT;
    }
    /* ==== Check busy. ==== */
    else if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        g_flash_dm_handle->activity = FLASH_DM_ACT_INITIALIZING;
        /* ==== If the FLASH DM is performing or the activity is not idle, do not initialize. ==== */
        ret = r_flash_dm_1st_check(FLASH_DM_INIT_1ST_CHECK);
        if(FLASH_DM_ERR_BUSY == ret)
        {
            ret = FLASH_DM_ERR_BUSY;
        }
        else if(FLASH_DM_ERR_REQUEST_INIT == ret)
        {
            ret = FLASH_DM_ERR_REQUEST_INIT;
            /* ==== If the activity is not idle, do not initialize. ==== */
        }
        else
        {
            /* ==== Initialize the device. ==== */
            if (r_flash_dm_init_env(FLASH_DM_INITIALIZED_ID, FLASH_DM_ACT_INITIALIZING) == 0)
            {
                ret = FLASH_DM_ERR_REQUEST_INIT;
            }
            else
            {
                /* WAIT_LOOP */
                do
                {
                    /* ==== Check the block header. ==== */
                    p_block = r_flash_dm_drvif_get_block_info(0);
                    nblock_full = r_flash_dm_drvif_get_block_num();
                    /* WAIT_LOOP */
                    for (i = 0; i < nblock_full; i++, p_block++)
                    {
                        /* The block header address of the block which p_block points at. */
                        p_bh = &p_block->p_img->h.b;

                        /* ---- Check the erase completion flag. ---- */
#if defined(FLASH_DM_CHECK_REJECTED_BLOCK)
                        k = 0;
#endif /* defined(FLASH_DM_CHECK_REJECTED_BLOCK) */
                        /* WAIT_LOOP */
                        for (j = 0; j < FLASH_DM_BH_ERASE_FLAG_INDEX; j++)
                        {
                            /* cast from uint8_t to uint8_t */
                            if (FLASH_DM_BH_FLAG_AA != p_bh->erase_end[j])
                            {
                                /* The block which is targeted for erase. */
                                p_block->stat = FLASH_DM_BLOCK_STATUS_GARBAGE;
                            }
#if defined(FLASH_DM_CHECK_REJECTED_BLOCK)
                            /* Check the rejected block. */
                            if (FLASH_DM_BH_FLAG_55 == p_bh->erase_end[j])
                            {
                                k++;
                                if (FLASH_DM_BH_ERASE_FLAG_INDEX == k)
                                {
                                    r_flash_dm_reject_block(i);
                                }
                            }
#endif /* defined(FLASH_DM_CHECK_REJECTED_BLOCK) */
                        }

                        /* ---- Check the block header flags. ---- */
                        if ((FLASH_DM_BLOCK_STATUS_GARBAGE == p_block->stat) ||
                                (FLASH_DM_BLOCK_STATUS_BAD == p_block->stat))
                        {
                            /* Do nothing   */
                        }
                        /* cast from uint8_t to uint8_t */
                        else if (FLASH_DM_BH_FLAG_FF == p_bh->ready[0])
                        {
                            p_block->stat = FLASH_DM_BLOCK_STATUS_GARBAGE;
                        }
                        /* cast from uint8_t to uint8_t */
                        else if (FLASH_DM_BH_FLAG_FF != p_bh->erase_start[0])
                        {
                            r_flash_dm_drvif_overwrite_block_flag(&p_bh->erase_start[0]);
                            p_block->stat = FLASH_DM_BLOCK_STATUS_GARBAGE;
                        }
                        /* cast from uint8_t to uint8_t */
                        else if (FLASH_DM_BH_FLAG_FF == p_bh->active[0])
                        {
                            r_flash_dm_drvif_overwrite_block_flag(&p_bh->ready[0]);
                            /* The block which has been initialized */
                            p_block->stat = FLASH_DM_BLOCK_STATUS_READY;
                        }
                        /* cast from uint8_t to uint8_t */
                        else if (FLASH_DM_BH_FLAG_FF == p_bh->full[0])
                        {
                            r_flash_dm_drvif_overwrite_block_flag(&p_bh->active[0]);
                            if (0 != g_flash_dm_handle->p_active)   /* There are two active blocks. */
                            {
                                ret = FLASH_DM_ERR_REQUEST_FORMAT;
                                break;
                            }
                            else
                            {
                                g_flash_dm_handle->p_active = p_block;
                            }
                        }
                        /* cast from uint8_t to uint8_t */
                        else if (FLASH_DM_BH_FLAG_FF == p_bh->reclaim[0])
                        {
                            r_flash_dm_drvif_overwrite_block_flag(&p_bh->full[0]);
                            if (0 != g_flash_dm_handle->p_full)     /* There are two full blocks. */
                            {
                                ret = FLASH_DM_ERR_REQUEST_FORMAT;
                                break;
                            }
                            else
                            {
                                g_flash_dm_handle->p_full = p_block;
                            }
                        }
                        else
                        {
                            r_flash_dm_drvif_overwrite_block_flag(&p_bh->reclaim[0]);
                            p_block->stat = FLASH_DM_BLOCK_STATUS_RECLAIM;
                        }
                    }

                    /* ==== Check the block state. ==== */
                    if (0 == g_flash_dm_handle->p_full)
                    {
                        /* There are not the active block and the full block. */
                        if (0 == g_flash_dm_handle->p_active)
                        {
                            ret = FLASH_DM_ERR_REQUEST_FORMAT;
                        }
                    }
                    else
                    {
                        if (0 != g_flash_dm_handle->p_active)   /* There are the active block and the full block. */
                        {
                            /* Judge the power shutdown because state is reclaiming. */
                            g_flash_dm_handle->p_active->stat = FLASH_DM_BLOCK_STATUS_GARBAGE;
                        }
                        g_flash_dm_handle->p_active = g_flash_dm_handle->p_full;
                        g_flash_dm_handle->p_full = 0;
                    }

