SunSunSun-23413011/RX231_Mouse3/Modified05 DF Clear/src/smc_gen/r_datfrx_rx/src/r_flash_dm_rx_if.c
                    /* ---- Check the position of the block which has been initialized. ---- */
                    if (FLASH_DM_SUCCESS == ret)
                    {
                        p_block = r_flash_dm_drvif_get_block_info(0);
                        nblock_full = r_flash_dm_drvif_get_block_num();
                        /* WAIT_LOOP */
                        for (i = 0; i < nblock_full; i++, p_block++)
                        {
                            if (FLASH_DM_BLOCK_STATUS_READY == r_flash_dm_drvif_get_block_info(p_block->index)->stat)
                            {
                                /* Check the active block of previous the block which has been initialized. */
                                if (r_flash_dm_drvif_get_block_info(p_block->prev) != g_flash_dm_handle->p_active)
                                {
                                    /* The block which has been initialized is error. */
                                    ret = FLASH_DM_ERR_REQUEST_FORMAT;
                                    break;
                                }
                            }
                        }
                    }

                    /* Check the block error. */
                    if (FLASH_DM_SUCCESS != ret)
                    {
                        g_flash_dm_handle->initialized = 0;
                        /* cast from uint8_t to uint8_t */
                        g_flash_dm_handle->activity = FLASH_DM_ACT_IDLE;
                        break;  /* Finish to initialize. */
                    }
                    g_flash_dm_handle->p_active->stat = FLASH_DM_BLOCK_STATUS_ACTIVE;

                    /* ==== Check the garbage block. ==== */
                    if (r_flash_dm_drvif_get_block_info(g_flash_dm_handle->p_active->next)->stat !=
                            FLASH_DM_BLOCK_STATUS_READY)
                    {
                        /* If the next block of the active block is not the block which has been initialized. */
                        r_flash_dm_drvif_get_block_info(g_flash_dm_handle->p_active->next)->stat =
                            FLASH_DM_BLOCK_STATUS_GARBAGE;
                    }

                    /* ==== Make data index. ==== */
                    ret = FLASH_DM_SUCCESS;

                    /* ---- Detect the oldest reclaim block. ---- */
                    p_block = g_flash_dm_handle->p_active;
                    g_flash_dm_handle->data_top = p_block->index;
                    /* WAIT_LOOP */
                    for (i = 0; i < g_flash_dm_handle->nblock; i++)
                    {
                        if (FLASH_DM_BLOCK_STATUS_GARBAGE == p_block->stat)
                        {
                            g_flash_dm_handle->p_reclaim = p_block;
                            ret = FLASH_DM_SUCCESS_REQUEST_ERASE;
                        }
                        else if (FLASH_DM_BLOCK_STATUS_RECLAIM == p_block->stat)
                        {
                            g_flash_dm_handle->data_top = p_block->index;
                        }
                        else
                        {
                            /* Do nothing */
                        }
                        p_block = r_flash_dm_drvif_get_block_info(p_block->prev);
                    }

                    /* Pointer to the oldest reclaim block */
                    p_block = r_flash_dm_drvif_get_block_info(g_flash_dm_handle->data_top);

                    /* ---- Make data index. ---- */
                    /* WAIT_LOOP */
                    while(1)
                    {
                        p_dh = p_block->p_img->h.d;    /* Address of data header. */
                        /* Last address of the block */
                        dp = (uint16_t)((uint32_t)&p_block->p_img->raw[FLASH_DM_FLASH_BLOCK_SIZE]);
                        g_flash_dm_handle->header_index = 0;
                        /* cast from uint32_t to uint16_t */
                        for (i = 0; (uint16_t)((uint32_t)&p_dh[0]) < dp; p_dh++, i++)
                        {
                            /* Check the flag of header update start. */
                            if (FLASH_DM_DH_FLAG_FF != p_dh->header_exist[0])
                            {
                                g_flash_dm_handle->header_index = i + 1;

                                /* Check the flag of header update start. */
                                if (FLASH_DM_DH_EXIST_FLAG == p_dh->header_exist[0])
                                {
                                    /* Check the flag of header update end. */
                                    if (FLASH_DM_DH_VALIDATE_FLAG == p_dh->header_valid[0])
                                    {
                                        /* Check the valid address. */
                                        addr = r_flash_dm_drvif_get_addr(p_dh);
                                        /* cast from uint32_t to uint32_t */
                                        if ((addr & FLASH_DM_BLOCK_MAX_MASK) == (uint32_t)p_block->p_img)
                                        {
                                            dp = p_dh->addr;
                                        }

                                        /* Check the flag of data update completion. */
                                        /* cast from uint8_t to uint8_t */
                                        if ((FLASH_DM_DH_VALID_FLAG == p_dh->data_valid[0]) &&
                                                /* cast from uint8_t to uint8_t */
                                                ((((p_dh->validity[0] & FLASH_DM_DH_INVALID_FLAG) \
                                                   /* cast from uint8_t to uint8_t */
                                                   != FLASH_DM_DH_INVALID_FLAG) && \
                                                  /* cast from uint8_t to uint8_t */
                                                  ((p_dh->validity[0] & FLASH_DM_DH_VALIDITY_FLAG) \
                                                   /* cast from uint8_t to uint8_t */
                                                   == FLASH_DM_DH_VALIDITY_FLAG)) && \
                                                 (p_dh->no <= r_flash_dm_drvif_get_datanum())))
                                        {
                                            /* If the data is valid, update the index. */
                                            addr = r_flash_dm_drvif_get_addr(p_dh);
                                            /* cast from uint32_t to uint8_t */
                                            r_flash_dm_drvif_set_dataaddr(p_dh->no, (flash_dm_ptr_t)(addr));
                                        }
                                        else
                                        {
                                            /* Do nothing. */
                                        }
                                    }
                                    else
                                    {
                                        /* Do nothing. */
                                    }
                                }
                            }
                            else
                            {
                                /* Do nothing. */
                            }
                        }

