SunSunSun-23413011/RX231_Mouse3/Modified05 DF Clear/src/smc_gen/r_datfrx_rx/src/r_flash_dm_rx_if.c
                        /* Check completion to the active block. */
                        if (p_block == g_flash_dm_handle->p_active)
                        {
                            break;
                        }

                        /* Pointer to the next block. */
                        p_block = r_flash_dm_drvif_get_block_info(p_block->next);
                    }

                    /* cast from uint32_t to uint8_t */
                    g_flash_dm_handle->p_data = (flash_dm_ptr_t)dp;

                    /* ---- Finish the Initialization. ---- */
                    g_flash_dm_handle->activity = FLASH_DM_ACT_IDLE;
                    /* cast from uint8_t to uint8_t */
                    g_flash_dm_handle->initialized = FLASH_DM_INITIALIZED_ID;
                }
                while(0);
            }
        }
        g_flash_dm_handle->activity = FLASH_DM_ACT_IDLE;
    }

    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d1_init() */

/************************************************************************************************
* Function Name: r_flash_dm_d1_read
* Description  : Reads data from the device.
* Arguments    : st_flash_dm_info_t * p_flash_dm_info
*              :    uint8_t     data_no         ; The data no.
*              :    uint8_t   * p_data          ; Pointer to read data buffer
* Return Value : FLASH_DM_SUCCESS               ; Successful operation.
*              : FLASH_DM_ERR_ARGUMENT          ; Failed operation of parameter.
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*              : FLASH_DM_ERR_DATA_NOT_PRESENT  ; Failed operation of the data no. to support.
*              : FLASH_DM_ERR_REQUEST_INIT      ; Failed operation and request initialization.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d1_read(st_flash_dm_info_t * p_flash_dm_info)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;

    /* ==== Check the parameter. ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    /* ==== Check argument === */
    else if ((p_flash_dm_info->data_no >= r_flash_dm_drvif_get_datanum()) ||
             (0 == p_flash_dm_info->p_data))
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    /* ==== Check busy. ==== */
    else if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        /* ==== Check status. ==== */
        ret = r_flash_dm_1st_check(FLASH_DM_READ_1ST_CHECK);

        if((FLASH_DM_ERR_BUSY == ret) || (FLASH_DM_ERR_REQUEST_INIT == ret))
        {
            /* Do Nothing */
        }
        else if (0 == r_flash_dm_drvif_get_dataaddr(p_flash_dm_info->data_no))
        {
            ret = FLASH_DM_ERR_DATA_NOT_PRESENT;
        }
        else
        {
            /* cast from uint8_t to void* */
            r_flash_dm_memcopy((void *)p_flash_dm_info->p_data
                               /* cast from uint8_t to void* */
                               , (void *)r_flash_dm_drvif_get_dataaddr(p_flash_dm_info->data_no)
                               , r_flash_dm_drvif_get_datasize(p_flash_dm_info->data_no));
            ret = FLASH_DM_SUCCESS;
        }
    }
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d1_read() */

/************************************************************************************************
* Function Name: r_flash_dm_d1_write
* Description  : Writes data to the device.
* Arguments    : st_flash_dm_info_t * p_flash_dm_info
*              :    uint8_t         data_no     ; The data no.
*              :    uint8_t       * p_data      ; Pointer to write data buffer
* Return Value : FLASH_DM_ACCEPT                ; Successful operation reception.
*              : FLASH_DM_ERR_REQUEST_INIT      ; Failed operation and request initialization.
*              : FLASH_DM_ERR_ARGUMENT          ; Failed operation of parameter.
*              : FLASH_DM_ERR_REQUEST_RECLAIM   ; Failed operation and request reclaim.(TYPE1)
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d1_write(st_flash_dm_info_t * p_flash_dm_info)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;
    uint8_t uc_tmp = 0;
    int16_t free_area = 0;

    /* ==== Check the parameter. ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    else if((p_flash_dm_info->data_no >= r_flash_dm_drvif_get_datanum()) ||
            (0 == p_flash_dm_info->p_data))
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    /* ==== Check busy. ==== */
    else if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        /* ==== Check status. ==== */
        ret = r_flash_dm_1st_check(FLASH_DM_WRITE_1ST_CHECK);

        if((FLASH_DM_ERR_BUSY != ret) && (FLASH_DM_ERR_REQUEST_INIT != ret))
        {
            g_flash_dm_handle->p_user_data = p_flash_dm_info->p_data;
            g_flash_dm_handle->dh.no = p_flash_dm_info->data_no;

            /* ==== Check the blank area. ====*/
            if (FLASH_DM_BLOCK_STATUS_ACTIVE != g_flash_dm_handle->p_active->stat)
            {
                g_flash_dm_handle->error_code = FLASH_DM_ERR_REQUEST_RECLAIM;
                ret = FLASH_DM_ERR_REQUEST_RECLAIM;
            }
            else
            {
                free_area = r_flash_dm_free_area();
                if(free_area <= 0)
                {
                    g_flash_dm_handle->error_code = FLASH_DM_ERR_REQUEST_RECLAIM;
                    ret = FLASH_DM_ERR_REQUEST_RECLAIM;
                }
                else if ((uint16_t)free_area < r_flash_dm_drvif_get_datasize(g_flash_dm_handle->dh.no))
                {
                    g_flash_dm_handle->error_code = FLASH_DM_ERR_REQUEST_RECLAIM;
                    ret = FLASH_DM_ERR_REQUEST_RECLAIM;
                    /* === Check if this module is processing callback. === */
                }
                else if(g_flash_dm_handle->flash_state == DATF_FLASH_CALL)
                {
                    ret = FLASH_DM_ERR_BUSY;
                }
                else
                {
                    /* ==== Start to write the data. ==== */
                    uc_tmp = (g_flash_dm_handle->activity | FLASH_DM_ACT_WRITING);
                    g_flash_dm_handle->activity = uc_tmp;
                    ret = r_flash_dm_dispatch(FLASH_DM_USER_WRITE_SETUP);
                }
            }
        }
    }
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d1_write() */

/************************************************************************************************
* Function Name: r_flash_dm_d1_erase
* Description  : Erases a garbage block.
* Arguments    : None
* Return Value : FLASH_DM_ACCEPT            ; Successful operation reception.
*              : FLASH_DM_ERR_REQUEST_INIT  ; Failed operation and request initialization.
*              : FLASH_DM_NO_INVALID_BLOCK  ; Successful operation no invalid block.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*              : FLASH_DM_ERR_ERASE         ; Failed erase.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d1_erase(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;
    uint8_t uc_tmp = 0;

