SunSunSun-23413011/RX231_Mouse3/Modified05 DF Clear/src/smc_gen/r_datfrx_rx/src/r_flash_dm_rx_if.c
        if((FLASH_DM_ERR_BUSY != ret) && (FLASH_DM_ERR_REQUEST_INIT != ret))
        {
            g_flash_dm_handle->data_no = p_flash_dm_info->data_no;
            g_flash_dm_handle->user_data = p_flash_dm_info->p_data;

            /* === This module checks whether initialization has been done. === */
            if (g_flash_dm_handle->initialized != FLASH_DM_INITIALIZED_ID)
            {
                g_flash_dm_handle->error_code = FLASH_DM_ERR_REQUEST_INIT;
                ret = FLASH_DM_ERR_REQUEST_INIT;
            }
            else if(g_flash_dm_handle->flash_state == DATF_FLASH_CALL)
            {
                ret = FLASH_DM_ERR_BUSY;
            }
            /* === Start processing. ===*/
            else
            {
                /* cast from uint16_t to uint16_t */
                free = (int16_t)(((g_flash_dm_handle->erase_block_num - 2) * DATF_F2_DATASIZE) + DATF_F1_DATASIZE);
                if (free < gc_dm_data_size[p_flash_dm_info->data_no])
                {
                    g_flash_dm_handle->error_code = FLASH_DM_ERR_REQUEST_ERASE;
                    ret = FLASH_DM_ERR_REQUEST_ERASE;
                }
                else
                {
                    ret = r_flash_dm_dispatch(DATF_USER_WRITE);
                }
            }
        }
    }
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d2_write() */

/************************************************************************************************
* Function Name: r_flash_dm_d2_erase
* Description  : Erases a garbage block.
* Arguments    : None
* Return Value : FLASH_DM_ACCEPT            ; Successful operation reception.
*              : FLASH_DM_ERR_REQUEST_INIT  ; Failed operation and request initialization.
*              : FLASH_DM_NO_INVALID_BLOCK  ; Successful operation no invalid block.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*              : FLASH_DM_ERR_ERASE         ; Failed erase.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d2_erase(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;

    /* ==== Check the parameter. ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_ERASE;
    }
    /* ==== Busy Check ==== */
    else if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        /* ==== Check status. ==== */
        ret = r_flash_dm_1st_check(FLASH_DM_ERASE_1ST_CHECK);

        if((FLASH_DM_BUSY != ret) && (FLASH_DM_ERR_REQUEST_INIT != ret))
        {
            /* ==== If the activity is not idle, do not initialize. ==== */
            if (g_flash_dm_handle->initialized != FLASH_DM_INITIALIZED_ID)
            {
                g_flash_dm_handle->error_code = FLASH_DM_ERR_REQUEST_INIT;
                ret = FLASH_DM_ERR_REQUEST_INIT;
            }
            else if (g_flash_dm_handle->invalid_block_num <= 1)
            {
                ret = FLASH_DM_NO_INVALID_BLOCK;
            }
            else if(g_flash_dm_handle->flash_state == DATF_FLASH_CALL)
            {
                ret = FLASH_DM_ERR_BUSY;
            }
            else
            {
                ret = r_flash_dm_dispatch(DATF_USER_ERASE);
            }
        }
    }
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d2_erase() */

/************************************************************************************************
* Function Name: r_flash_dm_d2_format
* Description  : Formats the device.
* Arguments    : none
* Return Value : FLASH_DM_ACCEPT            ; Successful operation reception.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d2_format(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;

    /* ==== Check the parameter. ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_FORMAT;
    }
    /* ==== Check busy. ==== */
    else if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        /* === Check if this module is processing callback. === */
        if(g_flash_dm_handle->flash_state == DATF_FLASH_CALL)
        {
            ret = FLASH_DM_ERR_BUSY;
        }
        else
        {
            /* cast from uint32_t to int8_t */
            ret = r_flash_dm_dispatch(DATF_USER_FORMAT);
        }
    }
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d2_format() */

/************************************************************************************************
* Function Name: r_flash_dm_d2_control
* Description  : Define various functions.
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS           ; Successful operation.
*              : FLASH_DM_ERR_REQUEST_INIT  ; Failed operation and request initialization.
*              : FLASH_DM_ERR_ARGUMENT      ; Failed operation of parameter.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*              : FLASH_DM_ERR               ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d2_control(e_flash_dm_cmd_t cmd, uint32_t* pcfg)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;

