SunSunSun-23413011/RX231_Mouse3/Modified05 DF Clear/src/smc_gen/r_datfrx_rx/src/r_flash_dm_rx_if.c
    /* ==== Check the parameter. ==== */
    if ((*data_no) >= r_flash_dm_drvif_get_datanum())
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    else
    {
        *data_no = r_flash_dm_drvif_get_datasize(*data_no);
    }

    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_getdatasize() */

/************************************************************************************************
* Function Name: r_flash_dm_getdatanum
* Description  : Gets the number of data.
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS           ; Successful operation and no erase block.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_getdatanum(uint32_t* data_no)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;

    *data_no =  r_flash_dm_drvif_get_datanum();

    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_getdatanum() */

/************************************************************************************************
* Function Name: r_flash_dm_getactivity
* Description  : Gets the activity.
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS           ; Successful operation and no erase block.
*              : FLASH_DM_ERR_ARGUMENT      ; Failed operation of parameter.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_getactivity(uint32_t* pcfg)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;

    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }

    *pcfg = g_flash_dm_handle->activity;

    return ret;

} /* End of function r_flash_dm_getactivity() */

/* End of File */
